![title](img/cover4.png)

<center><em>Copyright! This material is protected, please do not copy or distribute.    by:Taher Assaf</em></center>

***
<h1 align="center">Udemy course : Python Bootcamp for Data Science 2021 Numpy Pandas & Seaborn</h1> 

***

### The Exercise for  Module 10

#### Instruction:  Please write your code after the phrase " ## Your codes begin here:"

#### Q1. Your first task is to read a dataset from a csv file with the path ('data/ex5.csv') into a dataframe with the name 'sales'? Then display the head of this dataframe?

**Hint1:** To read a csv file you will need to use the function **pd.read_csv()**.

**Hint2:** To display the head of a dataframe you will need to use the function **head()**.

In [1]:
import pandas as pd

## Your codes begin here:

#### Q2. In this task you need to set a multi-index (Hierarchical indexing) for the dataframe 'sales' by using two columns ('year' and 'quarters') as the index and to save it to a new dataframe with the name 'sales2'? Then display the new dataframe 'sales2'?


**Hint:** you will need the function **set_index()**.

In [2]:
## Your codes begin here:

#### Q3. Select a subset of data from the dataframe 'sales2' which only belong to the year 2011?

**Hint:** To select from the row index you need to use the function **loc[ ]**.

In [3]:
## Your codes begin here:

#### Q4. Select a subset of data from the dataframe 'sales2' which only belong to the year 2011 the quarters A?

**Hint1:** To select from the row index you need to use the function **loc[ ]**.

**Hint2:** To select from the two levels of the multi-index, you need to include them in a **tuple**.

In [4]:
## Your codes begin here:

#### Q5. For the dataframe 'sales2', calculate the total sales for all quarters (sum) for each year separately?

**Hint1:** To calculte the sum you need the function **sum()**.

**Hint2:** To make calculation for a specific level in the multi-indexed datafarame, you need to use the argument **(level =**).

In [5]:
## Your codes begin here:

***
# Solutions
***

#### Q1. Your first task is to read a dataset from a csv file with the path ('data/ex5.csv') into a dataframe with the name 'sales'? Then display the head of this dataframe?

In [6]:
import pandas as pd

## Your codes begin here:

sales = pd.read_csv('data/ex5.csv')
sales.head()

   year quarters  sale1  sale2  sale3
0  2010        A    200    258    592
1  2010        B    328    664    606
2  2010        C    870    249    918
3  2010        D    209    971    629
4  2011        A    348    863    929

#### Q2. In this task you need to set a multi-index (Hierarchical indexing) for the dataframe 'sales' by using two columns ('year' and 'quarters') as the index and to save it to a new dataframe with the name 'sales2'? Then display the new dataframe 'sales2'?

In [7]:
## Your codes begin here:

sales2 = sales.set_index(['year', 'quarters'])
sales2

               sale1  sale2  sale3
year quarters
2010 A           200    258    592
     B           328    664    606
     C           870    249    918
     D           209    971    629
2011 A           348    863    929
     B           475    999    610
     C           944    356    540
     D           190     12    673
2012 A           129    936     14
     B            31    877    181
     C           646    768    862
     D           284    792    688

#### Q3. Select a subset of data from the dataframe 'sales2' which only belong to the year 2011?

In [8]:
## Your codes begin here:

sales2.loc[2011]

          sale1  sale2  sale3
quarters
A           348    863    929
B           475    999    610
C           944    356    540
D           190     12    673

#### Q4. Select a subset of data from the dataframe 'sales2' which only belong to the year 2011 the quarters A?

In [9]:
## Your codes begin here:

sales2.loc[(2011, 'A')]

sale1    348
sale2    863
sale3    929
Name: (2011, A), dtype: int64

#### Q5. For the dataframe 'sales2', calculate the total sales for all quarters (sum) for each year separately?

In [10]:
## Your codes begin here:

sales2.sum(level = 'year')

      sale1  sale2  sale3
year
2010   1607   2142   2745
2011   1957   2230   2752
2012   1090   3373   1745

***

<h1 align="center">Thank You</h1> 

***